// Title: Suspicious Browser Extension (Chrome)
// Author: Elmark Corpus
// Created: 8-20-2025
// Description: Custom query that checks for suspicious chrome browser extensions by getting rarely created .crx files under DeviceFileEvents table

DeviceFileEvents
| where TimeGenerated >= ago(30d)
| where FileName endswith ".crx"
| where FolderPath contains "\\Chrome\\User Data\\Webstore Downloads\\"
| extend ExtensionID=tostring(split(trim_end(".crx",FileName), '_').[0]) // get ext ID for every .crx file name
| summarize FolderPaths=make_set(FolderPath), Devices=make_set(DeviceName), LatestTime=arg_max(TimeGenerated, ActionType) by ExtensionID
| extend NumberOfDevices=array_length(Devices)
